#language: ru
 Функционал: Наушники

  Сценарий: Выбор Наушники

    Когда выбран пункт меню "Маркет"
    Когда выбрана категория 'Электроника'
    Когда выбрана подкатегория - 'Наушники'
    Тогда выбирается пункт 'Все фильтры'
    Тогда выбирается минимальная сумма "5000"
    Тогда выбираются производители "Beats"
    Тогда нажимается кнопка 'Применить'
    Тогда элементы выводятся в виде списка
    Тогда проверяется, что элементов на странице 20
    Когда вводится название товара в поисковую строку
    Тогда выбирается соответствующий товар из выпадающего списка
    Тогда проверяется, что выбранный товар соответствует запомненному значению

